[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
!
"
#
$
%
&
'
(
)
*
+
,
-
.
/
0
1
2
3
4
5
6
7
8
9
:
<
=
>
?
@
[
\
]
^
_
`
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
{
|
}
~
##9
##5
##8
##7
##2
##6
##3
##0
##1
##4
##a
##f
##n
##w
##g
##c
##l
##e
##d
##s
##x
##i
##o
##q
##h
##z
##t
##b
##k
##u
##m
##y
##p
##r
##v
##j
##tr
ptr
##32
i32
al
##gn
##ign
align
##64
i64
##un
i8
##el
##oun
##ound
##nt
lo
##ad
load
i1
##re
##ef
##ab
lab
label
##to
nound
noundef
##et
sto
store
##me
##al
i16
to
br
get
##eme
##ptr
##eleme
##ntptr
geteleme
getelementptr
10
##ex
##ext
in
##lo
##bound
inbound
inbounds
##ca
11
allo
alloca
12
##in
13
##unc
14
##mp
vo
##er
##cmp
16
tr
15
icmp
##all
call
##id
void
##te
str
25
##rc
int
17
18
crc
##on
19
zext
20
21
sext
##st
##nal
##ernal
internal
ad
add
24
22
un
crc32
func
pr
23
32
trunc
26
##sh
##ine
##af
##ame
##ul
27
pri
con
const
30
28
##nd
saf
safe
##at
29
def
define
ret
##or
31
##name
##ant
constant
nul
null
##shr
##va
priva
private
and
addr
unname
unnamed
33
00
34
##ct
tra
##are
##int
ll
##vm
llvm
ne
##le
lshr
36
##yte
35
##ar
##lt
glo
##bal
global
255
##lat
##ns
##pare
trans
##parent
transparent
slt
42
##72
##sw
nsw
40
##arg
no
byte
37
xor
uint
38
##16
targ
target
di
##49
eq
39
48
##12
ph
phi
sg
##uct
struct
##ic
##op
loop
41
44
45
43
64
53
51
##ile
56
46
p0
49
##em
mem
47
##47
50
##mv
52
##inct
##stinct
distinct
co
##ntext
context
##iz
##ck
##ft
55
volat
volatile
##95
##tu
57
##67
##85
54
##80
##ue
true
##83
ge
le
ma
main
sgt
##bu
at
##ibu
##tribu
##tes
attribu
attributes
su
sub
##15
##03
58
##ift
##shift
256
##75
##ion
59
65
60
##33
##22
##ntf
printf
63
62
##ut
fr
po
plat
siz
##for
##line
##res
##inter
frame
pointer
platfor
size
platform
##ing
61
##win
##wind
s0
ar
noun
##ack
nounwind
66
69
67
70
##def
undef
72
68
##ead
union
##77
##89
read
75
##19
mul
##10
128
##65
73
80
fal
##se
false
##45
##82
fe
79
##60
74
71
##42
##35
77
##62
82
##ff
##pp
##8a
cp
fp
##69
ato
bu
fmv
mat
non
out
st
v8a
##ner
##cto
##ote
##ures
##mic
prote
##atures
trapp
neon
##mv8
gener
leaf
armv8
features
##ffer
cpu
atomic
buffer
math
outline
stack
##ctor
protector
trapping
generic
atomics
##od
mod
tab
85
0a
##40
##cp
memcp
memcpy
83
78
76
de
##ll
##cl
wi
##rn
##retu
##ory
memory
decl
##llretu
willretu
declare
willreturn
81
##87
84
89
##17
##it
90
87
88
##init
86
92
ashr
##13
96
95
306
##63
97
93
##43
91
##672
100
lshift
99
rshift
429
94
##05
102
98
105
127
##09
ug
112
104
103
int8
107
109
##02
sge
101
int16
uint8
##able
int64
int32
uint32
uint64
##49672
42949672
uint16
sle
113
##6749
108
be
4294967295
sh
shl
##di
##div
##la
end
uw
##gin
##table
##vel
##ntab
strcmp
gentab
level
3066749
begin
uwtable
306674912
110
div
##he
che
##su
##cksu
checksu
checksum
8b
115
106
##ytes
8bytes
111
120
##14
##88
122
116
119
or
zer
##ial
##oinit
##izer
zeroinit
##ializer
zeroinitializer
114
117
125
##92
123
118
sdiv
124
##ri
##rite
##68
##07
121
126
##685
##99
132
##28
##483
##inu
##ly
##ptu
##captu
##only
nocaptu
nocapture
129
##18
133
130
135
##44
uge
137
##as
##ias
##alias
noalias
131
134
s1
139
136
142
145
922
##7203
140
##97
##4775
138
143
2147
##337203
##48364
214748364
##6854775
922337203
##685477580
922337203685477580
##93
152
##48
147
148
144
##00
141
149
155
##11
150
160
146
153
163
164
157
165
162
151
01
154
159
##73
156
ff
##66
158
167
##55
172
169
##128
i128
175
168
173
161
185
170
166
177
179
192
183
171
182
u0
174
##7215
176
180
187
178
195
aa
write
1677
f0
16777215
##de
##ay
tmp
##ch
##kn
##gs
##so
##og
op
so
##ng
##wn
cla
dat
dso
file
fla
gn
ide
linu
mu
n32
pi
pic
ra
s128
ub
ver
wch
##non
##cal
##sion
##ip
##om
##out
##own
##h64
##tnon
##urc
##pr
##untu
local
##alay
##inline
trip
##rch64
##stpr
unkn
##ule
##ndom
noinline
##ress
module
aarch64
##ogress
optnon
sourc
clang
datalay
filename
flags
gnu
ident
linux
mustpr
pie
random
ubuntu
version
wchar
triple
unknown
optnone
source
datalayout
mustprogress
193
##84
189
184
181
##52
ha
aft
lx
##shing
hashing
after
190
##dex
index
188
205
##79
186
202
##04
##61
212
197
203
##rem
s2
191
199
200
194
198
209
207
u1
196
##mm
213
imm
##fre
##gme
##call
##back
nofre
nocall
argme
writeonly
immarg
nofree
nocallback
argmem
204
208
201
210
##37
##08
9223372036854775808
211
206
2147483648
327
214
215
216
##41
222
217
219
223
220
##90
218
224
constinit
225
221
##write
readonly
readwrite
232
227
229
233
226
228
##53
238
240
230
srem
235
231
237
u2
242
##78
252
239
236
234
ugt
247
243
241
245
244
##46
249
##39
250
246
248
##yp
typ
type
262
253
264
##24
##70
minu
unar
minus
unary
254
251
257
260
259
##81
258
265
263
##56
2147483647
272
269
9223372036854775807
261
##59
##86
267
270
268
275
266
##01
273
277
271
280
274
279
282
f1
285
276
288
292
278
312
283
289
##96
##23
##57
281
287
284
293
##94
290
##06
295
286
297
f2
305
302
291
300
294
299
##71
298
307
296
##98
303
308
301
304
309
317
320
##91
##25
313
310
322
315
311
##30
319
##76
f3
324
u3
316
325
##74
314
318
s3
323
##31
332
f6
321
##20
ule
##38
328
336
ult
##36
335
329
326
330
331
333
334
342
344
338
337
339
##set
memset
340
f4
343
345
##34
i24
f7
360
341
364
347
352
346
348
349
350
355
351
##27
353
357
354
356
362
##50
365
359
367
358
372
361
363
368
370
369
655
376
366
##29
374
##51
384
371
375
373
##58
##54
382
377
383
379
380
378
381
f5
392
385
400
387
386
412
389
419
388
391
393
390
399
395
396
402
394
397
432
u4
398
403
401
405
404
407
413
f8
416
410
409
406
411
408
420
418
414
415
422
423
424
417
425
421
426
32768
udiv
f9
i80
430
427
436
428
444
i56
433
##21
##26
448
449
urem
434
i48
431
435
440
438
437
445
443
442
439
464
472
452
441
##162
480
447
451
450
446
65535
454
455
453
457
462
463
459
456
458
468
460
467
##642
i72
06
465
461
##322
##852
##823
473
471
469
466
490
03
470
fd
07
476
##892
475
484
482
487
##802
478
477
512
##152
02
08
##805
##475
fb
504
485
474
511
481
479
32767
04
483
488
499
516
486
500
489
##422
505
492
536
495
##192
496
##193
493
##632
##649
fc
05
##165
491
i88
##492
502
497
532
494
##873
510
503
##102
498
##607
##033
##035
##455
501
##722
##950
509
517
##602
##645
513
##122
547
##125
##833
515
##850
507
##163
##893
##622
##325
fa
s4
506
508
##457
09
##605
##625
##153
##675
518
##452
519
##692
520
##109
##643
514
##190
528
##151
549
522
##639
529
##647
##825
##720
521
523
i112
i104
##859
535
533
##183
524
##693
##857
##158
525
##955
545
##655
526
##809
##752
539
530
##144
##170
568
527
i40
543
##635
##167
##155
##879
##890
##899
##753
##629
##169
##727
537
##827
531
##652
538
##677
542
##435
##197
##107
560
##402
##697
572
534
##425
##105
##199
##855
##623
##664
##129
##897
553
##423
##952
##198
##030
##620
##150
##657
##130
##725
##609
##953
##499
##143
564
##135
##830
##497
540
##132
##630
546
##755
##853
##427
541
##800
##133
##473
555
##659
565
##139
550
552
548
544
##637
##470
##160
554
##803
##633
##495
##329
##437
##173
##175
##729
583
558
##127
##807
##429
##159
##433
##723
##493
551
##679
562
559
##837
##157
##148
##420
##858
570
##124
##829
##820
##670
##327
##779
##328
##191
563
556
##898
582
557
##405
##957
576
##959
##839
567
##053
##138
##699
##123
573
##120
##808
##653
##400
569
##407
##137
##698
580
##227
585
577
##458
##627
##479
##178
##600
##673
561
##439
595
##039
##638
##728
592
575
##777
##409
##036
##179
616
##352
##459
566
##092
571
##690
##634
##477
##450
612
603
##695
622
##037
##640
581
579
578
##658
584
574
##355
##604
593
##222
##478
##055
##650
##438
##453
##835
589
##724
605
##131
632
##353
##954
##750
##330
586
##187
588
602
i96
s5
587
607
##134
613
596
##424
##628
590
594
##851
##878
618
599
##804
##896
##108
597
##757
##759
615
##471
##608
##408
##025
598
617
##682
##644
##359
##104
##870
591
##474
##023
##038
i120
##694
##093
648
600
604
633
##100
##494
##824
##651
##034
##678
##654
##339
##194
##320
642
608
614
##174
640
##168
##337
##888
##648
##101
##828
##059
601
609
619
629
628
i152
##430
##498
606
##894
610
##333
##838
624
##671
611
##057
##836
##454
##925
##958
##871
##070
i144
##773
##456
##490
##674
##073
##111
##031
667
##029
##027
707
620
627
##166
##323
##324
##224
##421
##184
##770
##684
##874
##136
##434
##884
672
625
##606
##335
##161
643
##121
##758
621
##052
##020
##626
630
##428
##937
637
##821
662
##621
664
623
##774
##476
635
##181
##098
639
##154
##225
644
##054
631
649
634
##426
##146
##196
##881
##979
##834
626
##431
##176
638
##171
##444
##126
##891
663
##406
##631
675
##097
##928
##778
##776
##721
668
##106
##229
##754
##350
647
636
685
##737
680
641
##726
##223
##876
##079
##050
650
654
##357
653
##831
##334
712
692
##806
##354
##321
645
657
651
##404
##951
665
##491
##854
656
##058
on
dead
sre
wr
unwind
652
##itable
##076
##970
sret
writable
##078
##801
682
684
##451
##681
##401
##927
##646
##999
716
##090
##141
##923
646
##920
##997
659
683
##939
660
##099
##496
783
##601
##661
u5
658
677
##358
720
##156
678
699
722
##624
765
708
703
##448
661
671
679
##338
674
676
700
710
673
666
688
##026
670
705
##484
669
697
##929
704
##886
##930
687
##094
719
698
##000
686
##856
##186
##781
695
##550
784
##751
689
##696
702
715
709
##081
##220
##554
##336
##004
681
##973
690
691
714
##096
694
##730
##656
##998
##676
##228
696
##826
##091
##739
723
733
##641
718
760
693
##686
##666
717
713
##956
##436
##990
##798
##771
748
732
701
##738
##356
711
##071
##028
##074
##938
727
##024
725
775
740
737
##846
752
739
728
749
##446
730
i136
i160
724
764
706
780
729
745
812
##841
##021
762
768
##525
721
##924
840
742
773
##552
750
##934
731
767
800
##978
##006
##734
862
769
759
##331
772
##370
770
##974
734
u9
790
##559
735
##441
785
##008
##636
##993
##994
810
816
726
754
738
744
736
##051
755
761
743
##326
##991
747
##756
##527
u6
758
753
##351
779
##931
763
##529
795
##486
880
789
757
756
##530
##221
802
803
960
##691
746
1342
793
##523
741
##056
805
2047
782
829
##226
839
766
##921
777
##534
1023
##553
##371
832
751
796
883
799
807
771
##8863
##481
798
776
##971
872
895
815
797
1310
774
833
853
787
##1735
##936
1d
##555
781
818
822
##736
##790
##1519
792
778
788
##8842
##001
##041
867
860
847
##046
##594
##378
2097
850
808
813
##731
835
##786
842
16383
857
##538
882
##8232
##7523
791
825
814
817
##520
##6842
864
##906
##8709
849
809
827
889
845
##4512
##4303
##791
786
820
794
824
859
843
801
##701
819
806
852
##796
863
834
##794
877
##3741
##8716
##4287
869
##7223
837
##7972
873
##976
865
910
823
821
830
811
885
i184
##539
804
875
##6923
##996
##086
858
##4833
i168
2035
851
1073741
##926
##0344
##8435
838
831
844
907
1216
##374
##521
884
##526
##4784
866
e8
855
836
##3185
4095
900
##238
888
912
935
893
1202
##6919
##901
828
841
899
##551
s6
##1602
1073741823
879
##8575
d7
6710
##557
d0
856
937
c7
826
848
887
##8562
881
##574
c6
b9
1040
131071
916
909
886
846
892
##4967
870
896
134217
903
##4714
524287
##9573
854
902
905
df
969
##8372
##394
##6909
2097151
915
##6235
##7562
67108863
a4
8191
dc
##1760
913
##8010
978
919
##9315
1182
##556
262143
cb
876
929
1e
268435
##7216
868
a0
908
878
920
##571
##1772
871
861
898
945
897
7f
925
134217727
268435455
ab
##6740
##8977
890
957
918
4194303
874
932
##8265
##576
e1
##396
901
##531
##43394
955
##524
8388
989
bb
75183
751830344
943
0d
##598
917
930
9e
##862
##8080
##1919
891
967
d3
940
##1501
0b
s7
904
d2
1035
1008
##398
cc
953
c8
e4
1215
##376
9d
ef
##558
8e
965
eb
1949
##4375
##391
8a
ae
894
938
1149
5407
##4442
##4235
931
##6132
c0
##4277
952
a8
c3
e6
##9767
d6
##706
138716
##8359
707972
##4247
928
##206919
##9506923
##2279506923
##3591735
8388607
1387162279506923
707972206919
1387162279506923937
7079722069193591735
927
179852
1798524784
b2
8f
d4
##284
a9
d5
ea
4210
8947
db
1049
##8987
##8990
##7980
947
203543394
972
a7
b3
1003
##1675
1048575
##281
5368709
##8922
980
942
bf
##7235
921
##8175
1265
1105
##4525
954
##0535
##1132
##6112
0f
##8399
936
1920
a3
1089
1275
##8795
0c
##1653
##8023
950
1000
##5504714
##31855504714
894731855504714
536870911
8947318555047148232
933
##1622
1005
##7208842
##95737208842
540795737208842
5407957372088424833
964
dd
1065
1013
1262
914
##8947
##6253
997
e0
944
949
33554
992
33554431
982
b0
##6433
1010
##1213
##1535
923
911
##1542
##1045
##4097
906
##6663
1f
1512
##4925
948
1028
995
1022
##6019
##1372
985
bd
1440
##1683
##1215
##8539
958
1903
##1525
962
1113
##141519
##1586842
42101586842
##14151941
4210158684214151941
c5
##4740
##8032
977
a6
1016
1919
973
##1449
##9714
b1
##85850
##8488
8d
ce
##8025
##7703
1a
975
b5
c9
##467
##4960
##1253
ba
##9516
##8319
##8960
##4507
976
1050
ac
##6451
##8035
##1982
##6065
926
##1416
i176
##8342
##8989
988
163862
1638624967
##8340
##1065
968
934
9900
1097
1680
##8364
##4510
##6392
cd
##1222
924
963
970
941
1045
1283
257223
##1295
##0393
1014
##75239315
##8585075239315
2572238585075239315
11602
1c
c1
##1695
##8523
1025
9f
9c
e9
1032
##7792
##6310
1129
##1862
##1697
##8310
##0533
1344
##4719
##6072
##6995
1001
##1440
ed
1119
1102
##6987
##1332
939
987
##0380
##6053
##1393
##6465
##1503
959
##8849
da
1285
##4983
##4797
##8262
5681501
568150187
##12632
6001
##1362
1024
1137
1595
##6782
##4522
1009
##6455
961
979
##1114
##7522
##1064
1107
##47375
b4
1122
##1217
##7764
##4295
1160247375
e2
##8587
##1932
974
##231
ee
##8968
##3527
##6994
##1765
951
##32864
7079714
##1560
##1539
946
##0987
##8862
##6687
1019
1765
1967
##9595
##8975
##6055
1029
984
d9
##6480
1080
1112
1145
##4969
##1585
##1985
##6973
##1397
1007
##0719
##6462
##1005
##8295
##6063
993
986
##9922
##6527
##4209
##286
##0007
1642
##0465
a1
cf
##8932
##8923
##8235
##1792
1039
bc
##7280
##8393
##1922
##6085
##6965
##6383
##0947
1092
##463
##6427
1012
1502
##8036
##1547
##6977
c4
1015
1043
##8949
##1089
##4238
##0912
##6852
##250
8c
d8
1185
##8067
##0333
##1012
##4255
##4016
##1737
##1345
##6319
9b
##3257
##4931
##1280
##6045
##8717
1002
##596
0e
##3289
##1520
##1047
##4272
##4260
##6967
1053
##4862
##1172
af
##0365
##8251
##6175
1111
##6815
##4229
1085
##2232
966
##4362
1072
1062
##1592
##7787
##7779
##1927
##6332
1004
##6880
##9996
##1572
##6505
##4062
983
ca
##863
##164
##1383
956
1057
1041
##8880
##1175
##251
##6453
##4592
##4345
990
1018
##1410
##8875
##1249
##6255
##6728
998
981
1055
##28664
##6110
78412632
##451255
##28664451255
7841263228664451255
##6532
##6575
##8792
1034
1063
##4970
##8097
##7735
##4299
1059
1037
1073
1094
##9590
##6715
##1740
##6364
971
999
##4145
1b
##3209
1712
##6792
##8385
##6922
##1371
##6344
1127
1064
1067
1033
##1017
##4509
##6265
##0243
##1460
b7
##689
##3243
##4909
##1555
##2262
##1734
1273
1048
1473
##9010
##4665
b6
##6475
1087
##7282
##4215
##8703
##8786
##1140
b8
e5
1264
##1382
##4319
1382
1672
##1013
##4267
##1468
##0793
##1872
##6172
c2
1165
1235
##9525
##6707
##8783
##236
1203
2102
##4782
##8905
##6559
##6018
##6250
##6493
##1235
##1942
##6999
1058
1078
##9303
d1
##200
1295
##7260
##1532
##6088
##8749
##1305
991
1020
##0925
1011
1060
##1204
##1241
##1022
##0517
1052
1030
1099
##8881
##3244
1083
##9519
##8936
##1992
##1085
1155
##6622
e3
1733
##1289
##8316
##0375
##8902
##1990
##1059
##1417
##1840
##1116
ec
##7219
##4732
##8570
##4237
##6349
1036
##6865
1042
1175
1212
1332
317980
##4764
##8380
##6385
1129767
1152
##1880
##1882
##4865
2381772
64817
##4442730
##328644442730
317980675
1129767920
2381772328644442730
##4905
##1243
##9535
##1567
##7561
##1002
##6522
1153
1237
648174229
##1655
##8543
##8231
##1415
1859
##591
##3282
##6492
1069
1117
1143
1109
1280
16893
##4735
##1575
##7712
##19275
1047
1935
##4919
##6777
##8306
##1003
##4292
##4382
1123
1079
1197
##6859
##1887
1770
1142
1263
1445
##4948
##8233
##1783
##1340
##6365
1139
##1860
##3265
1095
##1635
##4769
##8066
##6292
##1799
##1793
1108
1227
1135
1495
1409
##1660
##1245
##8309
##7555
##1009
##4585
##4579
##8256
##6902
##8702
##1309
##4312
##1422
##8883
##6840
##4164
##6222
1189
##4951
##9522
##9521
##6916
##6992
##6317
##0249
##1489
1225
1904
a5
##6499
1017
1600
##4922
##3315
##8961
##4232
##4208
##1732
##6858
1484
##8964
##4545
##6912
##1764
##1733
##1762
1006
##4356
##1335
9a
##4702
##0352
##7760
##6924
1270
1199
##1865
1167
1602
2110
##7254
##4949
##1202
##1912
##1072
##6905
##4340
996
##4433
##4885
##48871
##1180
##1142
1335
##7257
##1689
##8390
##8255
##6010
##8797
##1365
994
1100
##1472
##1462
1689348871
1077
1505
##4955
##4780
##1578
##7560
##3340
##8965
##1082
##4505
##6854
##6633
##7212
##4771
##1069
##4565
##6205
##1302
1021
##0610
##613
1075
1372
18737
##7237
##4932
##9570
##6702
##8522
##8588
6692
##1935
##1099
##4008
##8762
##6377
##6397
10062
1200
1323
##1297
##7599
##4099
##6315
##1412
##1842
a2
##6402
1160
1447
1603
2002
268539
##6735
##0364
##7532
##1739
##0509
##8832
##8877
##8472
##6180
268539026
##7552
##1977
##1998
##6523
##4285
##6932
##6993
##4071
##8715
##8710
##1442
1555
##1103
2029
1132
1177
##8002
##1515
##3383
##8942
##1972
##6280
##6207
##1745
1223
1429
##52705
##6780
##6752
##8005
##1974
##6217
##1700
9568
1253
##6853
##80255
i200
1133
11879
##7295
##4767
##8043
##7545
##8919
##8935
##1900
##6594
##4230
##4010
##1716
1093
##1419
1173
##6864
##4840
1606
##6474
1367
1609
24081
##8017
##1995
##42327
##1303
##6375
1071
##1485
##8867
16077
##6689
##0447
1082
1432
1909
##1292
506255
##8503
##8582
##8362
##1587
##8992
##1079
##4075
##1749
##1719
##6395
##6725
1027
1084
1068
##4812
506255433
##4873
##6473
##6421
1562
##4908
##1252
##9509
##0397
##0358
##8995
##4564
##6960
##8765
##6367
1061
##8860
1192
##4822
1720
1475
1402
2103
##6755
##7702
##8909
##8289
##8257
##1743
##6305
1038
1090
##1486
##1818
1504
1757
##0435
##3230
1260
##8912
##1364
1120
##1885
##18170
1920465
444197
##1447216
##84881447216
1006252705
1920465435
44419784881447216
4441978488144721629
1462
1880
2045
207203
##6710
##4575
##4557
##8780
##1785
##1398
##0506
##6850
##6195
##4603
##4622
2072034873
1292
##4965
##1299
##6716
##4572
##8209
##6283
##6241
##8785
##1380
##6343
##6309
1081
##6103
##4228
##6445
1210
1415
1728
1960
##1607
##1630
##3380
##7732
##1941
##4203
##4265
##3549
##1349
1031
1070
1150
1193
1259
##0733
1331
##80572
7833
##6405
1392
1543
2048
##4790
##6766
##8029
##1593
##1965
##8293
##8273
##6029
##1343
##6727
1026
1076
##1443
##9003
##258
##3273
1110
1187
1305
1767
2082
##4940
##8533
##1598
##6557
##1767
##4397
1297
1873718170
669219275
##6409
1205
1815
1964
##851114
##1583
##7512
##7719
##8972
##8903
##1007
##1000
##4533
##4527
##6311
971602
1044
1154
1114
##1467
##8846
1252
##00121
##642957
##1757
##78112
1187900121
##851114642957
971602851114642957
##6422
1164
1140
1848
##7264
##8003
##8917
##8999
##1078
##1070
##4501
##8297
1159
##1433
23344
##8133
##946235
##858169
829858169
1903946235
##1208
##8535
##8548
##8392
##8978
##8998
##6571
##4503
##4269
##3528
##6273
##4086
##1705
##6389
##8895
##8886
##6846
##9349
##4880
1939
##63249
##3293
1592
190535
##7268
##1685
##4972
##1260
##0336
##7533
##8939
##8925
##6534
##8239
##8789
##1341
1088
1337
##3917
28968
##1678
##1267
##1218
##8057
##1595
##0303
##6092
##4042
##1769
##1386
##0799
##1810
##4416
##536
##1754
##6449
1219
1209
1599
1933
##8305
##8940
##8272
##4207
##6724
1046
1144
##6867
1301
##7345
##3714
##6438
1115
1572
##4934
##8545
##8039
##8337
##7530
##8997
##8993
##6552
##8247
##1385
##4305
1074
##1465
##6877
1322
1214
1999
2052
##1209
##4741
##6750
##8572
##8502
##1559
##7549
##65559
##4085
##1797
##8812
1778968
##8687
##6253471
##632496253471
1778968632496253471
e7
##1256
##9556
##6761
##8071
##8920
##1055
##6573
##8259
##87633
8442327
##1441
##8815
1198
##9202
##1816
1357
##6682
844232735
1522
##9549
##9523
##8537
##8378
##1599
##0387
##6963
##6978
##4091
##1703
##1304
9572
1138
##1463
1179
##6610
2127
##8132
##6225
1905359996
##3249
##3223
##6430
1245
1585
2095
2000
##4924
5428
##8333
##7775
##6596
##8269
##8202
##4216
776687
##6926
##0943
##6885
##0063
##6680
##6119
##9077
##7616
776687166
##3225
##6435
1349
1597
##1229
##9551
##1549
69623
##3505
##3502
##6918
##4077
##8735
##8700
1130
1118
1184
1420
##1147
##1133
##6616
16763
##8467
2025
##667
1309
19144
##7239
##4968
##1257
##8303
##8353
##8357
##1963
##6582
##4532
##6002
##4202
##6295
##4065
##1701
1051
1096
1104
1141
1255
##4410
144429
1643
1573
##053925
##6906663
1444296906663
1444296906663053925
##432
##64521
1735
1997
##1603
##1233
##1270
##8565
##8069
##8395
##8339
##1997
##8282
##6067
##6271
##4093
##8747
##8760
##1300
##4314
##8864
##6869
##0749
##1849
1452
##0022
1952
##449
##6466
1172
1428
148372
1703
1865
1902
##7252
##6772
##8529
##8072
##8009
##1994
##4582
##4537
##6979
##4095
##4395
1054
1146
##7905
1676380255
##6437
##6420
1545
##4916
##1265
##9529
##6714
##8500
##8367
##1565
##4526
##6297
##6903
##1744
##4387
##4398
##6720
##6855
##9798
##4867
1953
##9810
##5819
##95578
##42011
##22208
19191792
1483724247
1919179278
##6425
1169
2032
##4792
##9532
##8555
##8927
##6595
##4549
##6210
##6242
##4025
##1399
##6723
##0558
##0903
1091
1194
1453
##1117
17822
##1321
##1750
176522208
1247
1435
1709
1893
##1652
##6763
##8061
##8059
##8334
##4544
##6980
##8705
##4393
1293
##4462
1454
##6432
1183
1375
17070
##8361
##8930
##6272
##6990
##4046
##1718
1229
##9299
1181
##1864
1458
1559
2018570
##0811
08l
##80066
201857005
##6481
1242
1618
19698
2016
2049
##7236
##1663
4919
##4717
##6731
##8505
##1548
##0308
##8252
##6057
##4242
##6209
##6936
##4055
##87664
##6394
##4374
1056
1124
1134
##8848
1168
1161
##0775
143422
##6695
##0449
##868975
##0172
##19460
##4510868975
14844510868975
148445108689758987
1180
1480
1509
3000
##1200
##1278
##4708
##6783
##8095
##1930
##1063
##6009
##6068
##4280
##6910
##1315
##1390
##4316
##6729
1098
1653
2034
990064521
u8
1232
1315
1345
1900
##1699
##1693
##4794
##1714
##1310
##4367
##4365
##8888
1220
1250
##68725
##0783
##19395
990068725
1914480572
1434221525
1268
##7222
##4907
##4703
##9586
##8509
##3311
##7774
##89791
##1999
##1010
##6025
##4205
##3532
##6264
1106
1066
##6832
##4838
##4463
##4882
##6611
1925
1103
1488
2003
2117
52605
##1531
##2202
##6565
##45190
1101
1156
1226085
1239
##0760
##9970
1354
##4482
1623
##0132
##0682
##89195
1226085475
i224
##3263
##6467
1302
1528
1872
1895
2072
2075
2073
2122
##7202
##4705
##4700
##9505
##8049
##8343
##1528
##0349
##8910
##8970
##8204
##8271
##6073
##6020
##6282
##6982
##8791
##17651
##1363
##4302
##6722
1206
1148
##9252
##11423
1759
1739
##725417651
##65559725417651
5260565559725417651
1277
1745
2033
2132
##1275
##9592
##8552
##8579
##8030
##1590
##1556
##1938
##1043
##4555
##4200
##6245
##6971
##1730
##1348
1191
1234
##6883
1328
1520
1725
2050
##0603
u7
##6463
##6488
##6497
1519
##7299
##1667
##4798
##1514
##158036
##4591
##45896
##8740
##4310
1126
##9209
1290
1852
1820
##4223
8645
##3238
2361
##7205
40855
##4707
##9520
##6799
##6700
##8504
##8033
##8332
##8365
##8363
##7567
##6586
##8276
##6281
##8764
##8708
12534
129497
##9365
##4810
542845190
696236987
1294976451
8492
##3232
##3267
1217
1905
##1673
##1203
##4799
##9512
##9585
##9502
##6762
##8063
##8093
##8336
##1558
##0353
##8962
##8986
##1940
##1902
##6563
##4541
##6059
1086
1207
##8811
##4415
1397
##0183
##899181
1606899181
408559521
##6442
1860
2085
2107
##7269
##4950
##1282
##4752
##8507
##8599
##8383
##1909
##8200
##4045
##8766
##6347
##0598
##0245
##8816
1170
1248
1296
14880
1625
##8603
##1326
##77964
957219395
1233
1269
1312
1685
1673
2105
##1668
##4926
##4745
##8592
##8015
##8022
##6500
##6506
##6526
##8277
##3525
##6299
##6974
##4052
##8799
##8748
##1469
1231
1186
1400
14084
1853
##6182
##230
##6335
##6483
##6426
1147
1213
1460
1532
##7227
##8517
##8593
59675
##7709
##1915
##4552
##6925
##4015
##1344
##0519
##0933
##9218
##4830007
13617
##1143
1604
1654830007
##0443
##6413
1116
1188
1267
1405
1899
##7226
##8373
##0337
##8937
##10525
##8274
##6078
##8782
##1381
##4363
1151
##6619
1854
##8468
8855
##3240
1403
1922
2022
##1679
##1264
##1225
##9533
##8073
##8079
##1534
##6555
##4551
##8279
##6080
##6099
##4211
##4273
##6261
##6943
##6981
1125
##0286
##8822
1230
1320
##1848
##4445
##9733
##0014
1626
##6635
195899
##5747
##95393
##630802
##07342
##59417
##80234
1642630802
1958997703
1692
2104
##72823
##0363
##4032
##8714
##1791
##1308
##6387
1157
1176
1341
##6613
1930
##0417
##4115
##63464
##6478
1333
1605
1762
3164
##7293
##7255
##1662
##4779
##4758
##9528
##9531
##6704
##8037
##1505
##0309
##0378
##8981
##1936
##1074
1284
##4524
##8281
##6079
##6027
##6289
##6254
##6997
##6900
##6368
##0292
##1832
##1817
1608
##0687
##3189
##954162
##73860
1492
##8589
##8573
##8347
##1522
##1511
##0305
##7515
##1914
##6005
##4243
##4079
##8781
##1710
1128
##0240
##9207
1266
##1814
##1112
##8460
23860
##7842
##1759
##03610
1361719460
##6450
1418
1773
1955
29030
##7241
##1657
##4773
##6712
##8567
##8513
##1577
##0399
##1021
##3595
##4022
##6370
1131
1294
##4489
1459
1438
##4845
##84135
##0468
##7882
##3865
##5045
##75262
##1688
##1627
##1224
##9599
##8040
##8038
##8397
##8370
##3308
##8967
##8907
##1980
##1975
##1970
##1097
##1046
##4548
##6003
##6075
##6082
##42606
##1367
##1392
##1379
##4383
##1482
##8885
1224
##8410
1946
##9622
##9142
##63933
##42570
86272823
1240
1863464
1907
26649
##7244
##4975
##1279
5018
##9557
##6709
##8312
##3392
##8985
##8934
##1061
1288
##4233
##6240
##6939
##8796
1136
##6822
1338
##9765
##11187
1679
1857282
2124
##979165
##63188
b9c
##092507342
59675092507342
1863464238
1857282456
5967509250734259417
##3219
##6464
1340
1497
1816
1805
##7259
##1611
##1661
##6737
##8065
##8092
##8335
##15642
##0392
##7777
##7717
##7737
##1973
##1053
##1025
##6550
##4583
##4500
##8775
##0215
1204
##0772
##0700
##1847
1391
##4868
##0622
38273
8677
1617
1564
1800
##4996
##4958
##1240
##8355
##7547
##7536
5973
##8916
##89053
##1928
##1921
8016
##6064
##4275
##4252
##6232
##1360
##1384
##4392
11991
1178
1424
1737
##6115
##19013
150480234
382731371
##663
##3237
1195
1419
1862
1979
##7209
##7200
##72632
##8549
##8062
##1537
##0372
##8969
1282
##6530
##6084
##4274
##6929
##4389
102801
1279
##8813
##9238
##6862
##1867
1358
##6665
1898
2053
##6135
##03593
##6220
##6355
##16689
1028014238
##687
##6479
2019
##7247
##1609
##1625
##4933
##1255
5233
##8530
##8554
##8074
##0307
##7762
##8915
##8921
##6046
##3597
##8738
##1707
##1374
##6346
##1432
##8817
1257
12535
##4466
1393
14306
1758
##47599
##uu
##rr
##3270
1560
##7267
##7286
##1639
##1671
##8041
##7527
1287
##6509
##6975
##6906
##1709
88827
##8872
##8882
##8843
1228
1196
1238
##1895
1304
1394
1652
##0445
##6189
##8149
##7188
##7632
##033827
##14875262
##053370
1502033827
##611014875262
88827611014875262
1163
1299
1675
1665
17425
1875
1993
##7228
##7251
##1694
##1698
##4985
##1205
##1244
##9559
##9550
##8027
##8351
##1512
##7548
##3399
##2256
##1960
##1905
##8299
##6070
##6094
##4218
##4250
##3590
##6944
##6920
##4005
##0900
1190
##0769
1218
1261
1291
##1877
1398
149093
1640
1655
1874
##6187
1970
##4680
##8140
##9445
##7633
##83005
##1327
1490936132
##117
1360
16997
1785
##7225
##4999
##1287
4423
5180
##4737
##6770
##8577
##0332
66554
##8943
##8973
##8994
##1931
##4573860
##8245
##3552
##6233
##6291
##8744
888588
##1312
##13664
##0905
1355
1370
1504573860
##4695
2791
##1583243
##1324
##09840
##5301583243
##16025301583243
6655416025301583243
888588692
##603
1303
1477
29029
##7291
##1237
##1238
##8528
##8538
##8331
##7569
##3353
##1092
##4279
##4239
##6298
##4007
##8745
##1373
9881
10901
##8841
##9297
1236
1244
##6843
##1883
##1843
##18222
1439
1601
1639
1629
##7373
1836
##4175
##49204
300095578
20344319
849278112
9833
1272
1449
342232
##1680
##1273
##8099
##1523
##1536
##8945
##1947
##1939
##6547
##6533
##4296
##6248
##4053
##8707
##1375
##6341
1121
1254
##6875
##1845
1352
##4480
##4486
1404
##9715
##0002
##6603
##6660
##1284
##8464
##3633
4994235
##692551
##851148
11820243
##6053146
##63188851148
##47599692551
##0533706053146
2034431908
3422320533706053146
499423547599692551
1182024363188851148
##309
##3254
##6439
1249
4009
##1656
44023
##9527
##6767
##0381
##2265
##7778
##1067
##6549
##6510
##6599
##6537
##8254
##6989
##6931
##4029
##4307
##0994
##1414
##1448
1226
##6847
13289
1334
##1164
1598
##4133
##3068
##49295
##457805
##05564
##55373
1638363933
1555979165
1331457805
440236594
##3233
##6469
1483
338399
##7292
3837
##1696
4639
##4751
##8510
##8553
##8012
##8044
##8358
##7744
##1916
##1993
##6051
##604951
##4054
##8790
##1316
##0297
1158
1208
##88632
1221
1325
##4839
##9318
1534
18747
1959
1957
##5669
##5965
##62507
##1835
##7536506
667604951
338399635
6165
##195
##6417
##6456
1162
1289
1368
1416
1507
1802
##1605
3953
##8519
##8008
##1566
##8983
##1964
##1051
##6515
##6579
##4535
##6032
##4270
##6200
##1378
1271
1251
##0761
##4417
1378
##4813
##1189
1826
##6183
##4180
##4683
##72267
##809471
66889195
9601172
1275809471
109014097
960117208
##3229
##3258
1442
1463
1547
19499
2055
##7214
##1628
##1608
##4742
##4757
##8594
##1500
##7528
##2255
##8982
##1989
##1095
##1023
##4240
##4063
9787664
##8844
1427
1645
1958
##7812
##784908
##0115
##234
##325802
##1353
12169922
1182325802
1595784908
##036107536506
5233036107536506
1874777964
978766405
1216992279
5233036107536506163
##3290
##3227
##32456
1383
17137
1973
##7283
##4952
##4754
523502
##8563
##7575
##7539
65526
##7769
##1996
##1923
##1042
##6508
##8210
##8292
##6052
##4059
##0949
##8887
##4467
1425
1524
1729
1794960
1761
##8442
##7967
2094
##4201862
##8763338
140844201862
867711423
44238378
523502538
1794960074
1408442018628763338
1589
##1665
##1670
##9579
##9537
##6718
##8031
##0345
##2227
##7799
7502
##1920
##65651
##4212
##4835
1470
##6632
1753
1927
183174
##8416
205463
2039
##0133
##3618
##6352
##1434
##83017
183174037
3082
##1633
##1690
##4953
##4959
##4921
##1262
##1211
4774
##8578
##8557
##8042
##8000
##8377
##1597
##1504
##0347
##0340
##7519
##7529
##7707
##8267
##8286
##3585
##4028
##1781
##1307
##4380
10748
##8845
1166
12302
1246
##2889
1300
##4435
##4446
1379
##9709
1550
##1177
##8419
2139
##9175
##3443
3641
##77709
501842011
1713710525
##bb
##3268
##3299
##3274
1243
1307
1407
1693
1503
1787
1932
2028
2145
386250
##1669
##1637
##4946
3949
##4766
##9552
##6701
##851754
##8028
##1552
##7597
##2200
6745
##8913
##1929
##1052
##1024
##6503
##4249
##6278
##4083
##1731
##0202
##6861
1327
##4837
##4834
134863
1434
1474
1552
1579
##6617
1678
2020
12621535
##1927846
750262507
386250851754
1348639010
1262153587
3862508517541927846
##3222
##6471
1016689
1377
14355
1705
1803
30925
##7297
##4977
##1276
##8007
##8056
##8001
##1582
##1530
65531
67805
##7795
##8979
##1948
##1018
##10626
##6566
##6554
7347
##8263
##6090
##3509
##6252
##8706
##1713
##6303
##6398
##4347
##0508
1171
1258
##0737
1339
##4895
1498
1494
1637
1723
1684
16695
##6114
##4189
##3935
##7002
##70054
##9145
##3065
##850693
##60909
##1339
##32947
##092631
6136740
6188265
##19660909
##868719660909
1782270054
1742542570
1699732947
1016689168
678054591
##850693092631
6136740868719660909
6188265850693092631
9455
9325
##3276
1317
1615
1575
1782
18755
2099
2133
3375
423618
##7217
##4942
##1232
##1283
##4772
##9554
5752
##6739
##8508
##8009840
##1524
5931
##2249
##7738
##8928
##8900
##8929
##6592
##4598
8275
##6940
##4000
##4315
##4371
1201
##1464
1256
##9285
##9987
1328009840
##1822
##4484
1647
169693
1730
##0466
2070
##413527
2229
##8695
##2363
##6644
##95714
##83900
##7280413527
423618198
59317280413527
1696930912
5931728041352742606
7757
8223
##669
##qq
1422
1499
14728
1697
1544
151760
1789
2077
2116
29857
3133
##124299
5682
##4760
##4768
##4755
5008
##6794
##0385
##7733
7511187
##1015
##60779
##3508
##6908
##1768
##6362
##6302
##0596
##090987
##8865
##8840
##6816
1330
1481
##7382
1994
##8145
##9683
##7133
##206465
65533
47867
##15792
##1241064
##0250303
937090987
2054631213
36411241064
1517606068
##124299099
75111870250303
##20646504
937090987124299099
3641124106420646504
7511187025030355373
##3239
1222
1493
1995
2005
20337
27809
##7233
##1672
##1288
##1274
##1231
##1236
4955
##9540
##8512
##8082
##8060
##8356
##3348
##2252
##2241
6612
7008
##8974
##1987
##6548
##8283
##8266
##4276
##6275
##6962
##6907
##6937
##6340
##0570
10216
##1480
1211
1329
1359
##4413
136222
1752
##0464
2125
##7072
##1839
##15980
##09489
10161750
88554579
1362221241
1016175085
##116
##3242
##3207
##3271
##6457
1319
1313
1343
15227
1702
1792
1882
1835
18770
2069
2822
##7245
##72695
##4914
##4990
##4998
##4759
##9572
##9562
##6773
##8379
##8398
##1553
##1529
##0314
##0368
##0359
626903
6905
##1971
##6507
##8242
##42739
770769
##6288
##6946
##4073
##4020
##1368
##4309
##0973
##1403
##9945
##1861
##93649
##0065
1578
##6683
1717562
##8465
##0882
##4664
264251
##82715
##88460
##92817
1199183017
945542739
2033715792
626903052
770769144
1717562475
264251178
##112
##3252
1464
1593
253311
1845
1972
1961
194433
2084
2639
##1629
##4795
##4718
##6742
##6738
##8396
##7507
66038
##7768
##1937
##1924
##10109
##6538
##6267
##6274
##8794
##1389
##0553
##0997
##0235
##0237
4294967294
1241
##6889
##9938
1457
1538
18748
##8612
##7664
##7665
##60782
##62200
##42597
##17982
194992817
1944333532
##cc
##3275
##3248
1395
1813
2083
348390
##1631
##4945
##1294
##1230
##9503
##9589
##9597
##8541
##8571
##8384
##1509
##1502
##0331
##3334
##1968
##1032
##1075
##1094
##1058
##8253
##6077
##6028
##6097
##4266
##6257
##8767
##8704
8438
##1361
##4379
1278
##0233
##0209
##1435
##8889
##8814
1373
##0075
1539
##66672
16735
17377
1839
##84657
2239303
##0663
4490
##32575
##63015
##15716
##698163
##09760
##153992
1253698163
253311471
348390836
223930346
##76842
##3213
1582
1843
1809
1911
2043
2092
30606
3490
3459
##7279
##4902
##1242
##1207
##1258
479922
##4738
##8590
##85821
##8053
##1564
##0339
##7571
##7793
##1949
##1944
##6539
##4578
##6216
##6208
##6927
##1775
##1311
##1396
##6369
##4373
##672008
##0592
##0200
1200793
##1445
##9245
##1869
##33720376842
##1145
##1113
1698
1837
##8469
2027
2137
##0810
##7822
##46033
45562
5473244
##89005
538650
##4359
##35372
##0966782
19030447
1435545896
4786733720376842
4799220966782
1200793998
547324484
538650131
1903044762
4786733720376842697
4799220966782672008
7151
##3286
##6414
##6401
##6498
10457
12358
14857
157779
1885
1897
1914
##7270
##4935
##4730
##6759
##6798
##6782715
##8515
##8078
##8348
##1581
##1521
##0306
##0338
65527
68655
##7770
##1049
##1057
##1027
##10620
##10970
##6516
##6502
##6247
##6983
##6998
##6930
##6345
##4332
##4396
##0709
##0792
##6857
##9935
16715
1936
##0410
2086
##9005
##4617
##7142
##752141
##65745
##49564
##72968
66372632
929752141
##77876782715
660384086
1577791335
6865577876782715
663726329
6865577876782715339
9105
##077709
##3288
##6490
1465
1533
1513
191079
226265
##7229
##4943
##4944
##6795
##6781
##8501
##8019
##7514
##7537
##3305
##8963
##1060
##6585
##65672
##6528
##4531
##8280
##6093
##3563
##62602
##4080
##17682
##1318
##4360
##4361
##0585
4294967293
113038
1062265
1186392
##686740
1321
##1812
##18183
13002
1348
1426
922077709
##9309
##1185
1644
1658
1650
##6635372
18332
19589
##8443
##7487
65528
##85022
##1834
##89732
##65918
##62872
##60867
##754686740
##69096635372
11496241
##699465672
86459238
98330517
1074865918
775769096635372
455626310
1910798316
226265654
1130387268
1062265199
1186392939
##75468674026
1149624175468674026
##69946567242
8645923869946567242
7757690966353728319
9954162
##3200
##6472
##6444
##6446
11130
12193
1347
1365
1433
1469
1565
1928
##7208
##1687
##1654
##4973
5658
##4716
##4777
##4709
5287
##9544
##8084
##8024
##1516
##15107
##0373
##0355
##0354
##2221
6651
##7705
##1945
##1054
##6076
##4082
##4081
8314
8174
##8737
##8730
##17620
1174
##9271
1401
##1182
1600598
##6688
17239
1754
1779
2058
##0485
2041
##4103
##7883
##3945
28513
##7482
##033605
##1359
##47007
##4335
##49309
##82889
##09049
597363015
102161434
1958972267
995416245
1600598637
8458
1399
1683
1635
1628
16959
1799
1807
2009
201013
3681
##9553
##1588
65534
##2289
##1028
##1048
##4253
##4234
##6203
##6276
##6947
##6988
##6938
##8768
##17633
##1394
##6307
##4394
##0559
113638
##67496
##9250
118109
##6868
##0712
##4441
1527
##0008
1558
##1115
1627
ffr
18575
##8485
##8487
18908
2098
##53150
##46173
##466019
##5687
##0147
##9635
##3103
5163
545466019
##198776
##630162
##6330
##03482
##07966
7541560
88353150
969630162
12654016
##173702
##7561033605
##685862872
1739198776
1946173702
201013837
1136381012
1181091070
7541560685862872
883531507561033605
1265401620
7541560685862872356
7774
s10
##814
##3221
##641393
10892
14134
15836
2595
1833
2067
2113664
296611
47370
##4750
50181
##8394
##8330
##1533
##1513
##7516
##7500
##7573
65529
##2275
6370
##8938
##1933
1281
##4567
##8206
##6008
##4248
##3533
##3579
##8772
##8733
##8734
##1708
##6379
##6308
##6371
9732
##0560
##0579
10207
##0965
##0923
107335
4294967287
##07645
##9738
1381
##0087
1530
1954
##6133
2191321
##308272
##29698
##47541
51309049
##15865
##40209
##129839
##820833
##131776
##750222
##05943
##19618
##55068
790820833
2047308272
978131776
104555068
##429529698
##193570
##158036641393
8223429529698
1472880066
2113664830
296611170
50181158036641393
1073358393
219132110
51309049129839
8223429529698153992
5018115803664139372
5130904912983905943
##kk
##3236
##6454
11325
1380
1389
1760
2040
30139
##1681
##1676
##4783
##4778
##6765
##8576
##8081
##8388
##8307
##1551
##0362
##7531
##75033
##3379
##89921
##1978
##1991
##6540
##651697
##6230
##6915
##878175
##1301
##6391
##6721
##0999
10925
##0217
113620
##9261
##6814
1361
##9719
##9370
1520811
1790
##4110
##9847
##7668
##7416
65532
##19360
##6229
##16744
##95797
##03665
8187792
##493119
1402878175
309253308
473708986
1136208025
1520811752
818779262
9955
##6452
1318
1616
1612
16649
1983
1982
29638
##7232
##1600
##1650
##1219
##8055
##8317
##1579
##1526
##0342
##0391
##8988
7595
##6517
##6578
##65677
##8285
7184
##4217
##3518
##6285
##6279
##6928
8392
7863
##8761
8919
##1798
##1736
##1370
##0261
##0231
4294967289
##9292
1430
1476
1470172
1657
##7309
1566
ffm
202452
##0818
29287
##5799
##9864
##82310
##12253
##62922
##4353
5534983
##1323
##32966
##724035
##10164
##87487
##05260
773724035
##167541
801682310
1470172630
2024521990
1385
1633
1619013
1535
24739
31371
3415642
##16994
##1214
4109
45653
4759
5222
##9564
##9507
##6706
##6758
##8544
##8068
##8090
##8308
##8354
##1527
##0346
##7570
65530
##3355
##8933
##8931
##89030
##4595
##4513
##4550
##6042
##4264
##4268
##4291
##6217982
##6964
##6949
##4009
##4023
##17629
##4313
##0552
##0527
1274
##0948
##0298
4294967288
12003
##0705
1311
1450
##4875
16019
1570
##7302
##6667
15812
1791
1926217982
##0422
##0414
##04334
##9061
##4635
##3067
##5832
##87389
##158492
##137934
62984657
##22965
##897718
1967158492
##425563
##434571
1273425563
1429897718
1757137934
1669503482
341564244
456536707
8726
##618
##3272
1362
1387
1417
1842
18031
21352
2484
24123
347188
##7240
##7231
##7234
##4976
##1223
##1234
4964
4941
##4749
##9555
##9591
5718
578999
##674797
##8020
##80184
##8387
##1541
##0341
67979
##7790
##6598
##4569
##4597
##4553
##45622
##6286
##4074
##8793
##1788
##17635
##6393
##6386
##63606
##4372
1276
##0931
##0291
##1444
##1461
##0743
##9937
##9931
1374
13183
##9311
1551
##1135
1630
26546
##0633
##3175
##15364
##89047007
##4358
##1988795
##824658
##1760193570
1129434571
##853712
##784203593
93256343
349089047007
1833207966
66511760193570
##17633784203593
347188697
578999652
6797917633784203593
3490890470071988795
665117601935704340
##3280
##3279
##3281
##32927
121416
1660
16092
15336
19829
2060
27825
##7243
##7273
##7204
##1664
##1621
##4941
5184
5579
##6774
##0311
##0379
##7517
##7502
##33675
##2230
##1088
##10059
##4519
##4558
##4554
##8288
##4219
##6212
##6985
##4089
##4027
8707
8877
##6378
4294967292
1134095
##0746
12970
##4815
1696
17569
1734
1778
1838
1827
##0412
2046
##9064
##7060
##06873
##1838
##65528
##85590
##67916
##40566
##6826
9671253
##8947853712
##338075
207309760
97321683
1619013144
241236305
49418947853712
1214169003
1134095006
967125302
4941894785371232575
fff
##3210
##3297
1314
13335
1744
27491
##7253
##7256
##7294
##4989
5375
4908
496761
##47120
##9548
##9508
##9558
57693
##6711
##8058
##1594
##7509
##3389
##1962
##1917
##1004
##6542
##6553
##8201
##8298
##6234
##6921
##4013
7880
8914
89070
9079
##6342
10232
##0964
##0902
4294967290
12022
##9259
##0789
##9909
13244
1308
##9319
1536
1649
165467
154334
1584512
1690
1808
1879
1950
21389030
2101
##4142
##4135
##0112
##9411
##0617
3173340
##16217
##32276
##15209
##6227
##6350
##49972
##49907
##47014
##40005
##45864
##036158
##60468
##1874
##49010620
##1111047
##0319590
71885821
##165360
##12152889
##1982021
##83420319590
##878614
1733878614
##488578
1999488578
##76161111047
##898112152889
1875532276
8438898112152889
1857560468
786376161111047
1803149204
496761191
5769383420319590
1543346523
1584512630
317334011
##49010620631
7188582149010620631
8438898112152889150
7863761611110478792
5769383420319590186
8621
##641503
1413
1449295
1699
17638
1883
1892
2115
2144
2980
##7265
##1636
##4915
4518222
##4744
##4756
##6717
##8521
##8350
##1576
##0366
##0357
##3309
##2245
##2290
6382
723315
##1080
##6551
##6000
##4002
##4068
##4057
##1782
##17197
8842
##4308
991982021
##0232
##0288
4294967291
11705564
##9205
##6817
##9910
##4449
##4485
139033
##4849
##0003
##0082
1491
##1110
##11323
1608523
16563
##7305
17259
1857
1850
1890
##5285
2037
##534512
##8183
##0175
##0688
##3019
##7449
##6324
##6224
##69303
##4352
##40237
##10503
##19933
##65932
##329474
##75865
##72665
##95185
716574
8959810
867641503
##8247807
1420036158
1297065745
1654673271
1449295642
1763832456
451822217
723315892
1170556400
1390334277
1608523737
##5345129719
716574320
895981076
8676415035345129719
##3246
##3226
##64173
10897
1514
15423
1797
1873
20406
27350
311299
##1682
4481
5391
##8087
##8375
##1574
##7580
##3313
##7765
##7763
##8991
##10679
7357
##8249
##4236
##42529
##4249564
##6933
##40021
901657
##13750
##6363
##6399
##4364
##67201
##0548
11503
##1466
##14129
##6863
##0731
##4830
##188925
##9792
1486
1496
1574
##6662
167190
1694717
1858
1929
1841
1904249564
##3712
##5380
487750222
##64989005
##6473505
54584
##75310059
##40288
##0308247807
##13149
##4081249
##77064
##75463
7988359
12029516
##152045
61654081249
##1768264989005
36810308247807
1533665528
273504794
3112996473505
9016571768264989005
1671908063
1694717854
798835904
1202951625
6165408124975310059
3681030824780747014
3112996473505188925
8892
##3278
##3251
##6494
##6431
i192
107792
16807
15426
1777
17039
1855
2042
26131
##72483
##7220
##72407
386559
4855
##1277
4511
4630
5265
##9542
##6775
##6756
##67534
##8597
##8525
##8089
##808587
##8304
##3333
##2292
##2273
##7798
##1093
##6570
##6591
##4516
##4556
##4244
##3570
##62455
##6948
##4090
##4096
##8713
##8743
##8788
##1712
##4390
9927
##0555
##0539
##0252
1324
##1815
13390
9228
1408
##9395
1557
2054
##0469
2234230
##9042
##0117
277850
29744
##3085
3238
##3460
40949
##89264173
##12208
##64764
##19977
##62392
##95201
##1438
##1333189
##6338
##72967
##421136
##191933
##1371421136
123762
##631780184
##0733631780184
##89201371421136
##737384
38371333189
49550733631780184
817467916
1092512208
5458489201371421136
1077921941
26131896
386559630
223423072
277850029
3837133318989264173
4955073363178018489
14497
15102
15330
15998
25750
258989
1749
1775
1769
18162
1948
2063
2142
2109489
22352
2832
31651
3309
346426
##7249
##7224
##1618
41557
5383
##4763
##6745
##6736
##8550
##8064
##1573
##1546
##0335
##0384
##3377
##2235
##7785
##8941
##1907
##19333
##19791
##6529
##65187
##4573
##8217
##8261
##8290
793353
##6043
##6969
##6941
##698035
##8739
896633
##1702
##63658
##4304
##0969
##0262
##0256
##0258
##1447
##1483
##8847
122463
##0714
##0734
1211142
##1889
##4481
13103
145830
##9399
14793649
16318
1708
17817197
1931
##8447
1891
20532
205165
##6113
2123
220820
26007
##27437
##5142
47145
##6398175
##1336
##1333
##3271013
##43908
##409651697
##478153
##33516
##621451
##12689
##934329474
810698035
1065478153
##141704
1227141704
##100930
##452710679
##773793
8314621451
##3067678
2109489138
3464263271013
415576398175
793353452710679
896633476
122463934329474
1211142058
1458304211
1479364987
1781719766
2051651700
220820124
8314621451409651697
3464263271013773793
4155763981753067678
7933534527106793549
1224639343294748990
7492
7759
##3253
1511
17105
176315
1832
1819
1912
19627
19979
20322
2155
2455
3209
00w
##7221
##1251
##12571
##6733
##8389
##8345
##8301
##1545
##0377
##0300
##3300
##89394
##1979
##1908
##1925
##4576
##8246
##6016
##6007
##6023
##4293
##3580
##3565
##3539
77647
##6917
##6984
##69786
##8742
##8701
##1742
##17886
8766672
##1347
##13054
##6348
##4399
99467
##0528
##0529
4294967286
11365
12087
##9254
##6812
##6813
1384
14812571
##0083
1490
1508
1531
##7303
##66150
15814
1661
19525
1937
1930610
1936463
1901
##0480
##6164
##3702
##0817
22545
##7810
2494
##60712
##6223
##64713
##1439
##1430
##13932
##67087
##40570
##35518183
6323
##8961592
6178472
##613269
##198235518183
##15879318
##439515879318
222965651
1510210970
25898972
1763151887
776478080
87666728961592
994679557
1481257188
1930610198235518183
1936463426
6178472439515879318
8766672896159213054
615980
9173
##gg
##6485
10950
1233516
1316
1516
1568
158009
1849
18020
18079
21659
3035
30450
2847
29168
428097
426714
##7298
3795
##4927
##1216
414797
4473
4519
5382
531611
515045
4754
##9581
5792
##15633
##0310
##036689
##2253
##7745
##7791
7575
##19632
##6504
##6501
##4523
##4594
##6022
##6074
##4297
##4259
##35906
##6256
##6942
##6904
##4088
##8769
903257
92520
9760
1001566
9939
##0278
123004
##07483
##0786
##9973
1406
##9364
##9312
15217
##0047
##0048
##1183
165194
1620
##7397
ffw
17207645
18517
##0864
##9047
##01452
27769
29761
30562
##2087
##3482
##581630
##16253
##64262
##42299
##19379
##035107
5498
##16709
##65201
##6976018
##897823
##6571295
##130450
##1357
##135137
##159130450
##72363
570096
582646
##62763
##77788
##628159130450
##89668
##19416
##1686976018
##1843282
##428808
692036689
78332
78359
##3781686976018
965581630
1262428808
##681593
##771221
##495540021
13236437
##668211
1762165360
3082628159130450
6905613269
247398231
870732966
8842495540021
##8939489
1952567534
6159803781686976018
1233516666
1807975033
428097135137
426714846
41479743
531611430
5150451843282
903257664
925206010
1001566677
1230048554
1651941992
1720764548
##657129583
582646654
1323643718
3082628159130450036
6905613269657129583
8842495540021771221
4280971351378939489
5150451843282681593
7722
##6176
##3247
##3235
##3259
##6411
##6436
12497
1364
1610
186475
196319
2128
2222
2340
286596
3198
31223
##7207
##1617
##1658
##16159
##161326
##4947
##4986
4105
411410
4450
446995
4771
##4715
5005
##9514
##9584
5754
##6791
##8052
##8091
##8051
##1510
##1570
##2233
##8948
##1906
1286
##6519
##6562
##8264
7765
##6991
##6934
##4060
##4006
##40407
##408862
##8763
##87808
##17170
87035107
##13459
##6312
##43000
##67258
##0590
##0901
##0259
##024769
11349
##9206
##6818
##68646
##1844
1451
##93125
1526
##4863
##00421
1501
1461
1624541
01j
##6615
##6618
1924
1888552
##6145
##61890
2030
1991
2087717
22744
##7844
25264
##0667
3025
##9822
367161326
##642737384
##892452
##6327
##893634
##16708
##69792
##6648
##1320
##6331
##7290558
##65399
##22760
##178642737384
##477684
##68480
##40149
##3382221
##973777
748893634
##02862
839024769
9017290558
1022973777
11290994
10019556
##42033382221
734716708
1580092363
304504382
1963196291
286596156
3198178642737384
446995029
##408862803
1624541146
1888552031
2087717041
9017290558408862803
1129099442033382221
1001955612
3198178642737384675
7677
7657
7473
8697
9629
##6410
12720
120987
1487
1619
1540
17802
17838
20163
20109
24696
27499
291698
3300
00j
3578
42330
##7218
3785
##1613
3966
48672
6475
5117
##9565
##9518
##6784
##6708
##67165
##67893
##8598
##8098
##1540
##1543
##1507
##15959
##151468
##0316
##2285
##19138
##1090
##4589
##6058
##4258
##4267496
##3567
##3523
##6935
##69682
8575
85330
##4094
##4098
8387
##8711
95857
##4318
##0593
1038886
##0276
##0250
11013
##9262
##6849
##0730
##1866
1350
##4465
1376
1390
##9739
15296
##1187
##1118
1624
1546
1591
1594
##7301
17373
171477
1871
18905
2023
21188
##0135
31290
29084
40567201
##2682
##322930
##89237
##15213
##9558786
##4337
##32848
##65364
##4794267496
##45303
##851151
##654038
##69603
8074665
1000151468
151289732
##831968
##420933
200265201
##618078112
1720831968
##8529618078112
1397851151
1854420933
400960712
##036654794267496
8919036654794267496
44818529618078112
##1717060
1209876222
291698224
423309558786
486729798
853307779
958578990
1038886109
1529615213
171477165
807466528
4481852961807811239
4233095587861717060
74775
##3255
##6447
11107
1695
17109
18155
2012
2093
2610
3456
##7258
##1632
##1604
##161017
##49999
##1212
##12133
643270
##4739
##950687
5438
##8070
##8313
##8374
##0302
##0374
##3372
##3347
6240
6879
##7739
7506
##8213
790663
##6024
##4245
7742529
##1314
##4366
91759
##0586
##0909
##0247
##0299
##0253
##146220
##68519791
##9901
##9998
1437
##9372
##4843
##0019
1638
16461
164805
##73871
ffs
1670
16968
1924822
18308
1934310
##8403
212339
207957
##4119
##9048
##7867
##4687
##8117
##59725
31247
##9695
##0662
##7116
31719
##2042
##51107
399857
436892452
##19340
##45716
##72009
##1837
##69390
##8908233
5427882
##4354
##8298797
##13749
##63460
##453171
##42419
6420973
6677597
##3231332
7033595
7806740
770674797
805161017
83373871
8881002
1013146220
19673865
##071997
##6859899
##1489654038
##199568519791
##84670392
##790504
##953930622
##5965092
1845453171
891460782
88928298797
1542610109
323812689
7833284670392
211888908233
747757416
6432703231332
790663690
774252961
917596999
1648051977
1924822437
1934310854
2079576977
399857190
542788268
642097369
667759743
7033595953930622
780674056
8051610171489654038
8881002199568519791
1967386514
889282987976859899
7833284670392950687
2118889082335965092
6432703231332790504
7033595953930622820
7493
9647
##3241
11052
12148
1472
1475463
1587
25427
1975
1910
2140
2784
29190
31556
##72165
3820
##16736
##4993
##4923
3903
398947
6454
511043
##4793
5041
##8047
##8076
##8050
##1518
##7535
##3337
6355
##8908
##1904
##1098
##1020
##6567
##6535
##8260
##6215
821422
##40648
##6390
##63825
##63426
##43781
##67259
##0511
##0524
##051865
127997
112637
##0264
##88625
##9275
124678
##0766
##9978
1326
##286770
1336
13744
1346
1426534
##9797
1525
##48854
1829
18267
##8482
##7916
##0433
1978
2031
2096
196600
##9060
##46176
##8115
##8617
##9603
##9403
##741208
32395
##3469
##5015
##64295
##32203
##823839
4900947
##80257
##6323
510051865
519152045
##19019
##72069
##170130
##169198
##10799
##6640
##43733
##62787
##6954
##1317235
##671169
##92505
##32440
##62172
668169198
##73015364
7931317235
860170130
##52032
##8175974
##198272009
1344338075
##685252
##3257807
##6250053
##7257198272009
20026281
##886325
568252032
1219343000
887773015364
2032263460
